{"podcast_details": {"podcast_title": "The Defiant - DeFi Podcast", "episode_title": "Everything You Need To Know About Liquid Staking & LSTfi", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/4586201/4586201-1652728945243-fb228ed7cf207.jpg", "episode_transcript": " Hey everyone, welcome to another edition of our weekly recap. This week we're having a really special edition where we're joined by Amit Gajala, who is the co-founder of Stator Labs, Daniel Dizon, founder of Swell Networks, and Ken Head of Institutional Sales at Pendle. And we're going to be diving into one of the, I'd say the hottest sector this year in DeFi, which is liquid staking and LSTFi, which essentially refers to protocols that are building on top of liquid staking tokens to help traders kind of manage risk, boost yields, and do all sorts of crazy stuff. So before we dive into that, we're going to start with a quick overview of how Ethereum got here in the first place. It's been quite a long road. Ethereum turned eight last month. So yeah, a lot of great stuff planned for the stream. And before we get started, we'd like to thank our sponsor Bumper, that it's a DeFi protocol that lets you defend your crypto from market crashes and downside volatility. And that's probably something that might have come in handy yesterday. So I hope everyone escaped unscathed after the carnage we had yesterday. And so let's dive right in. All right. So taking us back right to the beginning. So what is Ethereum? Ethereum is a public blockchain, of course, that enables the execution of smart contracts. Most of us have used it, and how is it different from a centralized exchange or any centralized database? It's basically a global network of computers that are working together, and they need to reach consensus and say that, OK, a transaction is valid or not. And if it is, it's appended to the end of the blockchain, can't be changed after that. That's the whole concept of immutability. You know, that's how blockchains work, of course. Ethereum started out very similar to Bitcoin with a proof of work consensus algorithm, in which miners, which are essentially computers running pieces of software that try and crunch these incredibly complex mathematical problems in order to earn rewards. And in this era, of course, Ethereum was emitting new ETH every block as rewards to these miners. And one of the main challenges of this algorithm, of course, is the environmental impact, right? Because the energy consumption was going off the charts, especially back in 2021 during the bull market. I mean, we would just I mean, I think we had daily comparisons of which countries Ethereum's consumption was crossing, right? So obviously, something needed to be done. And I think it also had a big impact in terms of institutional interests, because a lot of institutions have ESG mandates, right? So they don't invest in dirty tech, oil and gas, stuff like that. So I'm sure there was that also played into the Ethereum Foundation and the community's decision to switch away from proof of work to proof of stake. And actually, before we move on, you can see from the chart that since the transition, there's been roughly 2000x, I think, or one two thousandth the power consumption now as we had under proof of work. So that's quite amazing. So of course, Ethereum 2.0, which is a name that we don't use anymore. But back then, that was the buzzword. So the idea was that Ethereum would switch from proof of work to proof of stake, the idea being that after running for so many years, like Ether as a token was sufficiently centralized, like enough holders had it. And it was time to switch to a new mechanism by which people who held it could stake it and run validators themselves in order to secure the network process transactions, basically take on the role that miners had until this point. So with a lot of fanfare, just before the bull market actually kicked off in earnest, we had the beacon chain launch in December 2020. And I remember it well, because that was when DeFi tokens were just bleeding and everyone thought the sector was dead. And yeah, and of course, as we know now, you know, 2021, the first half of 2021 for OG DeFi was a sight to behold. And who knows if we're ever going to see those kind of runs for those tokens again. But anyway, I digress. Just memories, right? Yeah, yeah. No. So the beacon chain launched in December 2020. And at the time, it was basically a one way street. You could stake your ETH, but you had no way of knowing when or if not if I mean, it was always on the roadmap, but you had no way of knowing when you'd be able to withdraw that ETH because at the time, like there was no timeline given. It was quite nebulous. And you know, Ethereum has faced a lot of delays in the past. So it was a real leap of faith for those who decided to, you know, as soon as it went live, let's take it was the true believers, I'd say, who, you know, took the leap and said, all right, you know, we trust in Vitalik. Let's go for it. Right. So this gave rise to the whole concept of liquid staking and the industry as a whole, I'd say, with the launch of Lido, which launched just a few weeks after the beacon chain went live. And this solved two problems. One, it took away the need for people to have the technical knowledge to run a node themselves, which is not a casual undertaking, even today, I'd say. Right. And why is this important? It's because if you are running a node and you have your each state, if your node goes down and you have, you know, issues and you have downtime, you get slashed, you essentially lose money. Your state is at risk if you're not if your node is not up to par, essentially. So that was one challenge. And the main challenge, of course, was that people wanted access to their liquidity, you know, since withdrawals from the beacon chain weren't enabled. Lido gave people a way to essentially have their cake and eat it too. Right. So they could participate in securing Ethereum while at the same time, they'd get this kind of receipt token representing their StakeTeeth called well, StakeTeeth, I guess, which was liquid and could be deployed across DeFi and used. I mean, today, it's almost, I'd say, equivalent to using ETH across DeFi with the amount of integrations that Lido has managed to put together. But back then, it was, you know, it was still a niche. And, you know, even as late as last year, when three arrows collapsed and there was a slight de-pegging event of StakeTeeth, it caused a lot of fud around the whole liquid staking industry. I'd say that was last summer was quite brutal for the markets. I mean, compared to then, I mean, we're still 2x higher in terms of ETH and Bitcoin, I'd say so. All right. And of course, we had the Shanghai upgrade that finally enabled withdrawals for the first time. This happened in April. And the liquid staking industry, I think, really took off after this happened because this took away one of the main risk factors that were associated with liquid staking, meaning could you actually get your ETH back at some point if you wanted it? Right. And with the Chapelle upgrade and withdrawals going live, that was taken out of the equation because it didn't happen immediately. But I think over the next weeks, all the major liquid staking providers started to introduce functionality to kind of get your ETH back. Redemption started to be enabled. And that, I think, gave people a lot more confidence to use these providers. And we can see that in the Lido TVL chart. So this is denominated in ETH because I thought it would give a better idea of rather than a dollar chart, which shows TVL down here somewhere. But you can see that in terms of ETH, it's just been straight up. Except for when we had the Terra collapse. I mean, that battered, I think, every protocol because the contusion effect was so much. Because a stablecoin vanishing means you had people who got liquidated on positions where they had borrowed USD against, say, ETH and other things. And that really took the industry back quite a while, I think. It took the industry quite a while to recover from that. So we had the USD deep egg. But again, after that, it's just been straight up and to the right. And after Shanghai, you can see it's gone through the roof, essentially. Which brings us to the current state of liquid staking, where there's about 20 billion worth of ETH staked through liquid staking protocols. But this pie chart also gives us a reason to pause. You can see Lido has nearly three quarters of the market, which is, of course, a concern. Being DeFi, we value decentralization above almost everything else. So today, we're going to be speaking to some of the guys who are looking to, I guess, take a piece of the pie away from Lido. And I think let's start with Daniel, if you'd like to talk about what you guys are building at Swell Network. Yeah, sure. Thanks for having me on. My name is Daniel. I'm the founder of Swell. Swell is an up and coming Ethereum liquid staking protocol. Yeah, quite right. I agree with the overall assessment here. It's incredibly important that we maintain a diverse and decentralized liquid staking market that preserves the underlying decentralization, security, and value of Ethereum. And it's also incredibly optimistic to see just the rise and rise of liquid staking and the de-risking of staking writ large post-Chapella. And we can see that in the chart moving post-Chapella in April of this year, that there has been more validators coming online. The queue is still, I think, about 25 days to get in, and there's virtually nothing to get out. So there's just been a massive demand for liquid staking. And we've been a real beneficiary of that. So we've been live on mainnet since about April of this year, late April. So just a touch over three months, and we're one of the fastest growing protocols in DeFi. And we're really trying to be a base layer and accelerant for what is now the biggest category in DeFi, which is liquid staking overall. And quite rightly pointed out that the industry generally is evaluation of about $20 billion. I'm not sure what the latest is at the moment, just with the quotation will drop in Ethereum recently. But with Swell Network in particular, we're just, over the past three months, we've been able to secure just over 45,000 each state with more than 10,000 unique depositors. And we've been really buoyed by this particular campaign for the voyage, which is, in summary, a pre-token airdrop campaign for people to get involved and to reward early adopters and stakers into our ecosystem. And that ecosystem of our LST, which is Swell Ether, has been increasingly and rapidly integrated within the DeFi ecosystem. And yeah, very, very excited to share more about Swell and talk all things liquid staking with you all. Cool. I'm kind of curious. Amazing. You know, we saw that pie chart, how semi-centralized, for the most part, centralized it is. What's to stop Swell from becoming the next Lido? And then if you guys do have that type of supremacy in the marketplace, how would you introduce sort of layers of decentralization within the organization in terms of the protocol level? Yeah, I think it's a great question. And it's a question that has to be answered in a holistic fashion between the social layer, i.e. layer zero, the social consensus, as well as just generalized market forces. Quite rightly that there is potentially an unacceptable share of market from Lido. But by the same token, Lido has also paved the way for liquid staking protocols. Generally speaking, in avoiding a situation where we had market share captures from centralized exchanges, but by the same token, there is a situation wherein any particular protocol that has a certain share of market may be a risk to Ethereum. And there's been various sort of thresholds placed upon that. So, for example, one of the seminal pieces came out of Danny Ryan, who said no particular protocol should have more than 25%. Lido has already well passed that on the cusp of a 33% threshold. And there's other thresholds of 51% and 66%. But by the same token, for new and up and coming protocols like Swell and others who have recently come to the fore, I think that's important from a market competitive standpoint. And I think that we are far and away from achieving that particular share of market, largely because of the fact that there are these inherent flywheels on flywheels, which lead to sort of these power law distributions amongst liquid staking protocols. And there is always this sort of counteracting force between public and private interests in the sense that do LDO token holders, how do their interests relate with stakeholders, relate with each stakers, relate with Ethereum large, relate with the entire blockchain ecosystem? I would follow that up. Oh, go on. Yeah, feel free to jump in any time. Tell me if I'm sort of just rambling on here. I mean, I would follow that up by asking then in that case, what in terms of an incentive stack can you do to build towards that from here? Yeah, this is a question. It's like, how does one appropriately utilize sort of commercial incentives or economic incentives and disincentives to try to drive new estate and current estate to shake that out, to bring it to newer protocols, i.e. protocols like Swell. And one of the techniques that we've done in the early stages of our voyage, just TLDR, the voyage is our early token campaign. We're going to do several chapters or seasons, which will then lead to the instantiation of the DAO or TGE. We've carved out a portion of our overall supply to early stakers. And then as a result, we're able to offer a higher blended yield because at the baseline of the staking rate is largely commoditized because it's just issuance from the Ethereum blockchain for staking. But there is that component where you can give and bootstrap your stakers with the governance token. At the same time, try to drive as much utility and integrations as possible. And we try to do that. Like we have folks like Pendle here on this call, who's been a major sort of collaborator with Swell and together by enabling that LSTFI stack with Swethe and the yield trading components and sort of the balancer or a Pendle sort of stack and then going through to Equilibria and PenPy. There are sorts of interesting sort of daisy chain of yield plays. If people want to do that particular thing, you can carve out a bit of a section of the market for yourself. But by the same token, I mean, there are other things that one could do as a protocol as well. And there are various levels of aggression, but it's just about the timing sequencing thereof. Interesting, interesting. I'd like to turn it over to Amit now to talk a little bit about ETHX and then a general question for both of you being how is your product different from, say, Lidos or Rocketpulls, who are the current leaders in the market? Sure. So quick thanks. Thanks a lot guys for having us here. My name is Amit. I'm one of the co-founders of Stader. So Stader has been a multi-chain liquid staking protocol. We currently have about 140 million total assets staked across several blockchains. We're one of the market leaders on Polygon. We started our journey on Terra 1.0, had about a billion dollars in TVL. And then after the collapse, we aggressively expanded to several chains. We are very early and trending Ethereum. Just launched about a month ago, have about 15k each state with us with several integrations across Curve, Balancer, Wombat, Pancake, Pendulum, etc. Growing pretty quickly. So that's a little bit about Stader. And E-Tex is our liquid staking token on Ethereum blockchain. It's a reward bearing token that kind of increases in price every time rewards are accumulated. Quickly talking about the, I think that's probably a good segue into your question, YVC. How are we different from the existing players in the ecosystem? So E-Tex is a very different architecture, which is a combination of the way I look at E-Tex is it's a two-sided marketplace. On one side, you have the liquid stakers that can stake any amount of ETH to get E-Tex, which kind of increases in price as rewards are accumulated. On the other hand, on the other side of the marketplace is these node operators. They can be like any type of node operators, professional node operators, or small and medium sized node operators who want to just run Ethereum validators. The fundamental premise with which E-Tex was born was that we want to create access to these small and medium sized node operators. Because if you look at the landscape, the entry barrier or the capital entry barrier for these node operators is significantly higher in the market. For a solo staker, it's about 32 ETH and ignoring the price drop over today and yesterday, that's roughly about $64,000, right, and ETH is at $2,000, which is a significantly high barrier to entry for anybody to start an Ethereum validator. Even some of the other protocols that allow permissionless node operators, they had a barrier of about 16 ETH. Now I think they have close to 10.4 ETH, which is again a significantly high barrier to entry, which is probably close to 25,000 odd. Now imagine somebody who wants to run 10 nodes, he has to cough up like 250k worth of capital on his own. And you can imagine how difficult or hard it is for somebody to start at least a small number of nodes. So that was one of the biggest things that we wanted to solve in the ecosystem, where we reduced capital barriers to entry to almost 4.2, just 4.4 ETH, where 4 ETH is the actual ETH that they need to bond and 0.4 ETH is the amount of SD tokens that they need to bond. SD is our governance token. The second problem that a lot of these node operators face is they don't want exposure to any other token other than ETH. So we wanted to bring that down as much as we can while we also creating some utility as well as downside protection for any kind of negative slashing events, etc. So that's the fundamental premise of where we started with ETHX. As we started thinking about this, sooner than later, when we are all here to kind of support decentralization and crypto, this means a lot of permissionless node operators can just like bond 4.4 ETH and start running validators. So we are creating access. Then the advantage of this is obviously now we can invite hundreds of permissionless node operators. We already have about 400 plus validators, 130 plus permissionless node, unique permissionless node operators that are operating nodes with Stator at 15k already. Sooner than later, we are going to hit a supply block or a supply wall in terms of scaling the permissionless operators. That's where we have this multi-pool architecture where we also have a set of high quality operators who can spin up hundreds of nodes without any type of collateral. So while on one hand, we have this pool of permissionless node operators who can just bond 4.4 ETH and start running validators. Once this supply hits a ceiling, we also have a fallback mechanism onto these permission side of node operators. We have four to five operators already on board running nodes with us. Just adding further extension to this, the beauty of what we've built is now this can be extended to several, currently we have two pools, this can be extended to multiple pools. Tomorrow if you want, we can spin up a pool where only KYC operators and KYC users can deposit and run nodes. And extend this to an institution that wants to run a liquid staking pool of its own without owning link with anybody else. So this is kind of a general idea of ETHX and the underlying architecture that we've built. And it's quite different from the existing architectures in the market. Interesting. Amazing. Thanks for that overview. I think that makes a lot of sense as to, I think, yeah, like you said, and Daniel too, Lido kind of paved the way for the liquid staking sector. They started off with fully permission, only their operators can run nodes, et cetera. And then we're seeing progressive decentralization of that stack, right? Where different projects are taking different approaches and trying to give users the best options. Right? All types of users, like you said. If you have a ton of capital or very little, you should be able to participate. That's the end goal. So I'd like to ask Ken now to introduce himself and talk a little bit about Pendle, which has been around for a long time. But I think really took off after the LST boom. And even before that, I think your marketing shift from option trading, yield trading to buying assets at a discount, I think that made it a lot simpler for DGENs to kind of understand what you guys are doing. Yeah. Happy to start. So my name is Ken. I head the institutional business at Pendle. And basically what that means is I reach out to different types of institutions, including liquid yield funds, centralized exchanges, wallets, and so forth, to deploy different types of DeFi strategies using Pendle markets. I think, yeah, you hit the nail on the head. We've been around since 2021 and spent the first couple of years building the EMM in our V1 and only launched our V2 in November last year. Since then, we've been, I would say, quite fortunate to be a central part of the LST FI narrative. Having said that, we are not an LST FI protocol. In fact, we are a fixed rates or yield trading protocol. And to what you mentioned earlier, assets at a discount on yield trading protocol, they're basically, I guess, two sides of the same coin. And we've been experimenting with different narratives for different target audiences. And essentially, the problem that we're solving in DeFi is that the fact that in DeFi, most yields are essentially spot or floating and that there's no fixed rates markets. So Pendle is a fixed rates markets. If you look at TradFi, the closest analog would be the swaps markets or specifically the interest rate swaps markets between fixed and floating rates. And we basically provide such markets for any asset that is yield generating in DeFi. What's been working very well for us since our V2 launch in November has been a lot of different types of LST tokens, as well as non-LST tokens, including revenue generating LP tokens from GMX or GainStrate. But having said that, the LST space is a very important part of the vertical to Pendle. It makes up more than 50% of our TVL. And very excited to chat more about the space. It's exciting. I just read about, I found out about swaps maybe a year ago. So I understand it's very, it's important as a crypto native, I didn't quite understand its importance, but realizing that it's a very important tool in TradFi was eye opening when I read that article and made the connection. So it'll be exciting to see how you guys do. I mean, it's definitely a little, you need a little more sophistication, I think, to enter the swaps arena. And I think with a lot of these LST five products, I think generally, we are waiting for DeFi to become simpler, but I almost think it's going to become more complicated as kind of the basic building blocks have been built out and now we're starting to play with yield, which I feel like is a more sophisticated realm of the market. I don't know what you guys think about that, but. No, exactly. I totally agree. I think especially with e-staking yields, now essentially serving as quote unquote, the risk-free rate in DeFi. And LST is essentially taking that yield and making it obviously very liquid, but what is lacking sorely in the space is a term structure, right? Or a yield curve in DeFi. Everything is spot, everything fluctuates from day to day, depending on utilization, staking withdrawal rates and so forth. But I think a swaps, you know, if, say, you know, Ethereum, the network can issue a yield curve per se, we can sort of let the market imply one via swaps market. So that's kind of the the the golf or the angle for us with regards to LSTs. Right, right. I think that makes a lot of sense because, you know, institutions don't want to deploy money day to day, right? It's they're looking for if you're raising a fund, you generally have a longer time frame and, you know, want to deploy capital at a fixed yield. You know, you want something that's predictable. And we don't have that in DeFi. Right. So as the industry matures and we move more from, you know, your day trading degens to hopefully more sophisticated long term investors. Yeah, this is these products are required, I'd say, like they form such a huge portion of traditional finance, right, swaps. And I think Forex, of course, is another huge market that DeFi hasn't quite cracked yet. But when it does, that's going to be the next next matter, probably, I think. And sorry, I know we're asking Ken a lot of questions, but can you explain just like super like on five, how do you how do you get a fixed rate out of a variable rate like the one associated with Stake to eat? I mean, just yeah, for someone who who barely, you know, maybe has taken a calculus class or something, but not much else. Yeah. I think the easiest way to think about it is to first understand the components within Pendels AMM. So we have to essentially we split the principal and yield portion of a yield bearing asset. Let's take LIDL-C for example, into principal and yield. So PT and YT for short. And the the main thing to know is that the relationship between PT and YT is that they have an inverse relationship. And if you look at, say, the swaps markets or trade-fi markets, PT behaves very similarly to a zero coupon bond or to a strips bond without without the yield, essentially. And so long as you hold PT to maturity, let's let's call it end of the year, you will redeem PT at par. And PT usually trades at a discount if you get in early enough. So that's kind of the fixed rates element. And the price that PT and YT trades is dictated from trading activities through the AMM. And that really determines what the moving yields would be. OK, OK. I'm getting there. Awesome. So now I'd like to ask you guys what our community would love to hear. For each of the tokens that you guys have created or issuing, what are the best ways to deploy them across DeFi? Where the best yields? How can we profit the most? Awesome. Shekhar, go first. Sure. Awesome. So, yeah, right now we have, since we just started about a month ago, we have over four to five primary DeFi integrations. The first one is on curve balancer. We are also integrated on Pendle. There's Wombat. That's a Dex from, that's a Dex from, popular Dex from BNB. And we have a few more integrations lined up across a few Dexes as well as learning protocols. So any user who wants to, who wants to earn further rewards on top of their Ethex, which is our liquid staking token, can provide LP on curve. I think today the yields are close, boosted yields are close to about 10% additional on curve convex. On the other one is Pendle. I think we've just did our bribes yesterday. There's about 35% plus boosted yields on Pendle for somebody who is choosing the balancer Ethex pool. And yeah, that's, and on Wombat, I think somebody who wants to provide Ethex LP, there's about 15 to 20% additional staking, additional rewards. That sounds tasty. Just to get an idea though, what are the, I haven't looked into the balancer pools yet, but what are the token pairings? Is it like the principal token paired with Eth? So it's, or is there, is it like a? Yes. So it's the Eth paired with our liquid stake token, which is Ethex. Okay. Yeah, that's great. Because I think that these prices, very few people want to take on the risk of impermanent loss, right? Pairing with stable. I mean, of course we could go lower, but where the true believers left, if we're still here after two years of bear, I mean, I think, yeah. So that's great to know. Daniel, moving on to Sweep. How can we maximize our pearls, my friend? Yeah, I think, well, I think the first thing to do is just to realize that you're still early to swell everyone that's listened to this call and on the call. Yeah. So the general rule is, you know, the earlier you stake, the bigger you stake and the longer you stay for the more pearls you get, pretty simple. And we've tried our best to really speed run a lot of the ecosystem integrations and partnerships across DeFi. Currently we're on main net, but we're going to go to sort of cross-chain, ideally next week, hopefully next week, if everything sort of checks out. And then in terms of like the specific strategies, I think just even just on a sort of a raw baking play because we're in this bootstrapping phase, I think it's a pretty attractive sort of play. But if you want to step through and go a bit further than that and utilize the LST sweep across DeFi, you can do that. And so we have the various integrations across multiple Dexs, whether that's something like a Maverick, a Balancer, a Curve or Univy 3. And we have the various emissions layers or meta governance layers on top of that. So for example, I'd be remiss not to talk about the Pendle integration here. So with regards to Pendle, you can do the Balancer or a Pendle stack. We have a lot of materials available and we're also happy to talk you through that on our Discord or wherever you have you. And then we also have a, we were the first team, I think, to the Externity to deploy a Pendle pool. So we work with the Pendle dev team and then we've done our Pendle sweep pool at the moment. So you can just zap in from ETH into the Pendle pool there and that will actually stack it for you. So you can just do that right on the Pendle UI. And at the same time, you can also on the Pendle own page too. If that's not really your flavor, you don't want to do the LP thing or you don't want to do the interest weight swap thing. We have also other integrations with protocols like Gravatar, which is a CDP, a C-back stablecoin. And also, even if you're not like sort of primarily going through Sweep, we have integrations with various index or structured product style integrations as well. Recently with Yarn, which is bootstrapping at the moment, it's YEath product and the high level, those are some of the integrations. But if you want to maximize your policy, that's general outlay. All right. That's good to know. I did, well, I had a chat with your official Twitter account, not sure who runs that, but I believe that if you deposit your Sweep on Gravatar, you don't earn polls yet, right? Yeah. So at the moment with CDPs, we're just generally working through what the incentivization looks like for that. But you can earn polls if you provide liquidity on GRI and Sweep. So when you borrow GRI by collateralizing your Sweep, that LP position on, which is primarily on Bunny, which is a layer top of UDV3, that's incentivized. So just generate at a high level the polls incentivization that happens with staking and LP for Sweep. Okay. Yeah. I'm waiting for, what's it called? Liquis, is it, to launch so that I don't need to lock any LIT tokens myself to get those boosted deals, right? You're on top of it. You're on top of it. You're on top of it. Yeah, you are, man. Hold on. You know, we do a weekly DeFi alpha newsletter, right, so it's my job to keep on top of yields. So we present best yield opportunities. Well, obviously he's bringing the heat this call, man. It's crazy. You know, talking of keeping on top of yields, we've seen the rise of a agon layer for people who want to take like their steak teeth and then further see returns on it. One of the things I wanted to talk to Amit a little bit more about is something that Stater is working on to help people kind of expose themselves to DeFi while seeing agon layers value too. Can you give me a little bit more insight on that? Got me out there. Yeah, so sure. So what we've been working on is actually something called the Liquid Restake Token. We just announced that last week. I mean, we've been following agon layer and all the narratives surrounding restaking. It's obviously a very interesting concept of using the Ethereum decentralized trust network or security to actually secure other applications or dApps or whatnot, everything. Now one of the questions that we asked ourselves is, hey, this is going to be, we are all in DeFi. LSD is in DeFi. Now restaking is going to compete against the DeFi opportunities. The most important question that kind of confounded us for some time was like, hey, how do we actually get the best of both worlds? That's where we got the, that was the genesis of liquid restake tokens where if somebody restakes their LSDs with the Stater's restaking contract, which probably is in testnet now and probably putting it out on the mainnet in a couple of days. So when somebody stakes their LSDs or ETH with Stater contract, we restake them on a set of validators running on agon layer. We issue something called an LRT. For simplicity, let's just call it agon ETH. And then we are going to build the DeFi ecosystem surrounding agon ETH like liquidity pools, additional reward opportunities, collateralized positions, et cetera. So if ETH based staking rewards are about 4%, there is, sky is the limit for restaking rewards, right? They could be 10%, 15% or 20% depending on the number of services that are utilizing the restaked LSDs or restaked ETH. I think this whole thing begs the question and forgive me for asking this. I think it's a perspective that's widely held when you see these types of things stacking on top of each other. Is this just a house of cards? Is it turtles all the way down here? Or I mean, how do we de-risk this space to make it appropriate for people to approach it and thrive? I think your question has the answer, right? We need to have fundamentally very, very strong risk management practices. That is where we're constituting a risk committee and a DAO to kind of have a close watch on what services we are onboarding, what is the risk to reward ratio that we're taking, right? So the job of the DAO or the risk committee will actually be to do a deep assessment on the services and only whitelist those services that qualify certain criteria, apart from general smart contract risks, et cetera. There's going to be slashing risks. There's going to be some other potential risks that we... There are so many unknowns in this equation that till restaking and some of the services on top of restaking go like, it's very hard for us to sort of imagine that at this stage. But having said that, if we ensure that the risk management is properly in place, it's a fundamentally new primitive that is going to be built on top of DeFi and restaking. Yeah. All right. Fascinating stuff. So, before we go forward, just a quick clip from Bumper, our sponsor for this week's recap. So here's something new. Bumper your assets to defend them from price drops without losing upside exposure. You set a price floor and term length, then lock your tokens into the protocol. When your term ends, if the price has fallen under your floor, you leave with stable coins at the floor's value. Otherwise, you just take back your original asset. Bumper is going live in August and it's one of the most innovative DeFi protocols for hedging being built right now. So check out Bumper.Fi. There's links in the description of this video. Now back to our story. All right. I would have been really curious to see how Bumper performed in a crash like yesterday's. I've been playing with this protocol called FX, if you guys are familiar with from Aladin Dow. So they're kind of creating this new stable coin, like dampened volatility stable coin combined with a leverage token that lets you basically go long without funding or liquidations. So yeah, it's nice. Like personally, I feel like DeFi has kind of stagnated a bit, at least 2022, maybe first half of 2023 as well. It was a lot of the same old being recycled into new packaging, essentially. And finally, we're seeing more innovation, like whether it works out or not. I just like to see new designs being attempted. That's why we're here, to iterate until we revolutionize the financial system. Not move fast and break things? That too. Yeah. I guess maybe going back to like a liquid Eigen ETH. I mean, I just wonder where the incentives lie. Maybe Stater will have strong risk management practices, but I wonder, is there going to be an incentive for some project to say, yes, let's take Eigen layer staked ETH deposits and give a liquid token for that? And can they? I don't know. I'm trying to think through whether, I don't know, like what are the incentives there? Like someone could like add some crazy yield on top of that. And I don't know, does that present a systemic risk? I don't know what you guys think, but you know, and maybe it just happens, right? I mean, you know, 2008 happened, we sliced and diced, you know, till our hearts content. So I don't know. I'm trying to see what the end game is and maybe we'll have to deal with that in like five, 10 years. I don't know. I think there is a fundamental difference between sort of 2008 GFC and this daisy chaining of DeFi and even like outside of DeFi more broadly into crypto. And the fundamental difference is just the nature of the blockchain on-chain transparency. And that sort of thing. I think that like generally speaking, just look at the DeFi sector overall. The DeFi sector is really a sector that is still very much in its nascent early stages. You know, we had DeFi 1.0, we came out with the fundamental building blocks or primitives and of core principle of DeFi has always been money, legos and composability. And so in some way, shapes and forms, it's largely inevitable that this composability and daisy chaining will happen because a lot of the financial innovation is actually being driven by hunt for yield, risk on sort of behavior coming from principally this idea that you can be permissionless. So you don't need to be a sophisticated, jump through the hoops of being a sophisticated investor or being in a particular jurisdiction that you can take these plays on. But by the same token, what happens is you have this effect derivatives, synthetics on synthetics, you have this re-hypothication and re-hypothication. And I would agree with the sentiments earlier made that there has been a stagnation in DeFi generally where there's just a copy of a copy of a copy. There's sort of similar lack of just nothingness, right? But something's different with regards to things like IHM layer, like distributed value technologies like ZK and optimistic relapse, these are real innovative infrastructural technologies. Where the yield isn't just because you're just gambling, it's actually there to secure another piece of the fundamental blockchain technology. So for example, Viagra layer, there has been criticism about that, but this idea of the inheritance of Ethereum security to build sort of data availability layers, application layers on top, that's a different sort of proposition. And I would say the distinction between that and something like collateralized debt obligations in the GFC or even more recently in mid 2022 with the cascading implosion of FTX, Alameda and all these sort of CIFI protocols is that DeFi is transparent. And during that time in mid 2022, all the way through to the shaking out of that, DeFi worked just fine. The liquidations on the Aave were fairly orderly. The bad debt was largely minimized because of this notion of isolated, the isolations. And there are definitely mechanisms such as committees and so on, like Amit's mentioned, but also I would say that the layering of smart contract risk is largely isolated to that particular layer. But then it goes all the way down. So it's incumbent on users to really understand those risks and for us to improve as an industry to be able to communicate those risks upfront. Yeah. No I think that's just one second. Yeah, I think that is a great answer. And it did make me think that it'll be interesting to see how if you layer on the same incentives of humans want to make money, but you layer that onto a more transparent system, whether that you kind of reach certain equilibria, which is kind of optimized in terms of risk reward in a way that maybe the obfuscation of traditional finance, there's ways in which where you end up on the risk spectrum may not actually be where people are comfortable, but it might be like that DeFi. I mean, the idealistic part of me is like you can hit a better point of equilibrium because the risks are more transparent. So that's an interesting thought for sure. Absolutely. I think Daniel hit the nail on the head with on chain transparency. All the names we saw collapse last year, all C5 players doing opaque stuff off chain, uncollateralized lending and everything and Celsius, they paid off DeFi loans as soon as they had to. But other depositors won't see money for years, most likely, like the actual clients. And to me, I'm not too technically proficient as to how smart contracts work, but to me, Eigen layer and the whole restaking idea reminds me somewhat of Cosmos and the whole interchange security model that they have been talking about for a couple of years now, right? Which is use the Cosmos hub to kind of rent out security to new projects so they don't have to bootstrap their own validator set, et cetera. So I mean, the concept seems the same. So if as a proof of stake, 40 odd billion value locked system should be able to take on a little bit more load, in my opinion. Yeah, we'll have to wait and see how it plays out. It's interesting because you see this sort of cycle of complexity in terms of the iterations of innovation that get put out in the marketplace. People who are on the core, on the zero layer, perhaps, are able to adopt those. And then centralized institutions that represent potential points of failure come up to sort of dissipate those layers of complexity and allow other market players to come into the institutional ones, for instance. And unfortunately, while we've seen a great boost from the institutional players that have come into the marketplace driven bull markets, we've also seen that with the central institutions that come up to serve them, we're introducing systemic risk and contagion to the marketplace because as these things become hinges and focal points where individuals turn to them in trade, we start to lose some of the decentralized Asian factor that helps to secure and create robust network practices and architectures. Yeah, quick question for Ken. With the rise, you guys support most of the major LSTs on the market, right? So in terms of inflows and your users' interest, which ones are people looking at right now? I think just by nature of being the largest and the most blue chip, it will definitely be LIDL-ST in different forms and depending on the chain, right? So on Ethereum, obviously on native-ST and then rep-ST on other chains. But we're definitely seeing different types of inflows from different users. Mostly from Stater and from Swal. And also from Binance as well. So rep Binance ETH, also some interest there. But yeah, predominantly LIDL-ST for now. It was interesting to see Binance jumping into the ETH staking game. That was not something I would have predicted even a few months ago. But yeah, I guess they saw that Coinbase is doing really well with their product, right? I think it makes a lot of sense because prior to Chapella, most of the staking products were basically led by exchanges. And if you look at the top stakers today, like by entities, it's still, aside from LSDs, exchanges like Coinbase, Binance and Kraken, they're still top five or so in terms of percentage of total staking. And I think now with LSD taking a lot of the, essentially achieving instant PMF and post-Chapella even more, right? Like it's basically gone up only. And we're basically seeing exchanges trying to play catch up with CBE, with Binance ETH. Who knows who will be next? So I think that's going to continue to be a trend. Yeah, I think that's good for the ecosystem. I mean, they're centralized players, but it still diversifies the overall liquid staking ecosystem. So yeah, I think that's pretty much all the questions I had for you guys, but I've kind of monopolized most of the streams. I'm going to let Owen and Jeremy go now. Oh, well, yeah, not a grilling, but I guess Ken, as a head of, I guess, institutional sales, I mean, are there interesting war stories or things that you think people might not understand about how to, like what kind of clients are you approaching? And do you tailor your sales pitch based on a client's, a potential client's background? Are people like super up on ETH and they're just waiting? Are they scared about security? Are they scared about the, you know, the ecosystem's long-term viability? I don't know. What is that like kind of interacting with big money players? Yeah, I think the term institution tends to be thrown around a lot, but in practice, there's a wide spectrum of types of institutions. So I guess on the left side of the adoption curve, there's all your prop funds, liquid yield funds, managing some external LPs, you know, your 20 to 50 mil type funds that are very frontier, a lot of on-chain strategies. Those are the guys that we tend to prioritize in terms of bringing liquidity into our AMM and also to capitalize on different opportunities from locking good fixed rates for duration and, and, or to take directional positions on their views on the yield markets. So that's one end of the spectrum. And I think on the other end of the spectrum, we have say, you know, a staking platform or institutional staking platform that are looking to add on more avenues of yields aside from just natively staking on the beacon chain. And you know, wanting to introduce something like Pendle Earn, which is basically long PT on Pendle, locking a good rate to maturity and having a solution that is on DeFi that is non-custodial. I think that's something that's quite in demand right now. A little bit of a shill here. So we just announced a couple of hours ago, integration with OKX Wallet, basically plugging in Pendle Earn as a modular infrastructure into OKX Wallet. And this is, I guess, the other side of the curve that we're approaching different types of institutions. Cool. Cool. Yeah. OKX has been doing, I know they partnered or they, I don't know if they partnered, but they integrated with Starknet and I saw the TVL on Starknet go a little crazy too. So they're kind of, I think, experimenting with some on-chain, I guess, integrations would be the word. Are the principal tokens supported on any lending platforms currently? I mean, can you leverage them up? Yeah, you definitely can. So the first protocol that announced integration with Pendle to support PTS collateral was Dolomite. And over time, we've seen more and more time swap being another example. And we're in discussions with quite a few protocols at the moment for PT specifically simply because of the way that PT behaves, I guess, quite predictably over time towards maturity and converging to PAR. The other use case apart from PT that has been quite interesting is some protocols are looking at ways to collateralize LP positions on Pendle. So that's quite frontier, but some conversations are happening as well. Interesting. We'll keep an eye on that. Fascinating. Like, strip the yield off an LP? Is that what you're saying? No, no, just to collateralize, let's call it a money market protocol, taking LP as collateral and allowing users to borrow off of that collateral. This would be borrowing against your balance LP tokens essentially, right? Yeah. Okay. Yeah, that would be nice to do as well. I've kind of haven't really personally dived into the Pendle pools just because like the strategy I'm trying to do is buy some ETH at a discount and then borrow it and buy some more. So, yeah, so I haven't found the set of protocols supporting that yet, but yeah, waiting for that. Yeah. Tell us when you find it. Yeah, man, it'll be in the alpha. I really like the Gravita, a sweet strategy because it lets you, like if you want conservative leverage, right? Like you borrow a little bit and boost your sweet position. You're not paying any interest. So it's like essentially free leverage. And if you have a safe liquidation price like mine, I'm not going to say it on the stream just in case I get hunted. But if you have a safe liquidation price, I mean, it's a great way to improve your yield. Right. Right on. That's good. I'm so glad to have you guys on the call because I rarely get to discuss these DGEN strategies with these guys. They're like, oh, no, no, we're not going to play with it. We'll write about it. We're busy working. I'm busy working, man. I can't do that stuff. Like I said, there's this layer of complexity that someone like me, I just need an asset management service to be able to turn over a small portion of fees to them and then let them leverage my eths to maximize the yields across and over protocols. Perhaps one will come in the future that allows me to do it across all of these protocols. Yeah, we'll see. But yeah, thanks guys. Good to make sure I do keep stepping up my game and stay on top of the absolute cutting edge of what's happening. Always more to learn. Yeah, totally. Likewise. Thanks so much for joining us, guys. We're reaching the end of the hour. So unless you guys have anything else you'd like to share with the audience, I think we can wrap up for today. Just on my side, yeah, I do think as well, it's also incumbent on the DeFi protocols to make it as simple as possible for users. I cannot expect everyone to be cutting edge of some of us. The call with like keeping on top of something like I was surprised about the literacy. But like, for example, with us, I think Pendle has done a really great job in sort of simplifying and bringing that down, like something like the own page. And with Swell, we're trying to always come up with new features that make it as simple as possible. Like liquid second made simple, that's our mantra. And being like a gateway into LST file. So I think in the coming weeks, we're going to come out with an own page where you can see all the strategies like nice and easily, like almost like it's like, I don't want to use a tripod, but like, it's like a vanguard for LSTs. So you jump on it, you can just see it there. It's all in one place. So but yeah, it's great. So the feedback and just hearing you guys talk about that at the end. Yeah, awesome. All right. So have a great weekend, everyone. And thanks for joining us. We'll be back next week at the same time for the next weekly recap. Let's hope we don't see a repeat of this week's market action next week. And stay defined. All right. See you guys. Thank you. Thank you. Bye bye."}, "podcast_summary": "In this podcast recap, the hosts discuss the rise of liquid staking in the DeFi sector. They are joined by representatives from Stater Labs, Swell Networks, and Pendle to talk about their liquid staking protocols and how they differ from each other. They also discuss the potential risks and challenges of liquid staking and the need for strong risk management practices. The guests highlight the importance of on-chain transparency in DeFi and the opportunities it presents for innovation. They also discuss the best ways to deploy their tokens across various DeFi platforms to maximize yields. Finally, they touch on the rise of institutional interest in the liquid staking space and the need for accessible and user-friendly solutions for both retail and institutional investors.", "podcast_guest": "Amit Gajala", "podcast_highlights": "In this podcast episode, the hosts discuss the rise of liquid staking and LSTFi in the DeFi sector. They provide an overview of the Ethereum blockchain and its transition from proof of work to proof of stake. They mention the environmental impact of proof of work and the switch to proof of stake to address this issue. They also discuss the launch of the Ethereum 2.0 beacon chain and the challenges and benefits of liquid staking. The hosts review the current state of liquid staking, including the dominance of Lido and the need for more decentralization in the market. They then interview representatives from Swell Networks, Stater Labs, and Pendle to discuss their projects and their approaches to liquid staking. The guests discuss the benefits and risks of their protocols and highlight their integrations with other DeFi platforms. They also talk about the future of liquid staking and the importance of risk management in the DeFi space. Overall, the podcast provides a comprehensive and informative discussion on the topic of liquid staking and its implications for the DeFi industry."}