{"podcast_details": {"podcast_title": "Paperback", "episode_title": "Ep. 82: Aakash Ranison", "episode_image": "https://www.omnycontent.com/d/playlist/e0dce4b3-2eb8-48cb-822c-af1d00e03e20/63f53c45-75ff-4e20-82f6-af4f00a3f14d/bdfe268d-a538-4cfc-b23d-af4f00a3f16e/image.jpg?t=1668592616&size=Large", "episode_transcript": " I V M Hi, I'm Satyajit. Hi, I'm Rachetha. Welcome to Paperback by the Open Library Project. We have as our guest today, Aakash Ranisan. In the first half, we discuss climate change activism, Aakash's award-winning art installations across the country. In the second half, we discuss Swami Vivekananda's teachings, the Harry Potter series and Start with Why by Simon Sinek. Happy listening. Take up an idea, make that idea your life. Live for it, die for it, ask your every nerve and cell to work for it and that's the only way to success. Anything which makes you weak intellectually, physically and mentally, reject it as poison. Always say, you are a hero, you have no fear. Thank you, Aakash Ranisan. Those were a few quotes from Swami Vivekananda. We'll be right back after this. Welcome to Paperback by the Open Library Project. I am your co-host, Satyajit, storyteller and entrepreneur. I'm hosting this podcast with my co-founder at the Open Library Project, Rachetha Sharma. Hi, guys, I'm Rachetha. I'm an ex-banker, social impact entrepreneur, podcaster, writer and publisher. You can check out my deliberations on Instagram at Neural Underscore Pathways and my articles for Drive Global India. The Open Library Project is a curated library service which we offer to corporates on a subscription basis. The idea here is to create value, build a knowledge community and encourage a growth mindset amongst our members. Today we have with us on the show Aakash Ranisan. Aakash is a climate activist, content creator and TEDx speaker. Welcome to the show, Aakash. Hi, guys. Thank you so much for inviting me. Happy to be here. It's great to have you on the show. And Aakash, before we get into Swami Vivekananda's teachings and why he's so inspirational to you, tell us a little bit about climate activism and how did you happen to get into it? Okay. How did I get into climate change? So, I didn't obviously plan. I have never been to any institute to study science and just to be on the point, while in school I was getting supplementary or failed results in each and every subject of science. So, not at all the science guy. But then I was travelling, while travelling I fell in love with nature. And then it got me to climate change. So, once I started my journey as a climate change activist and focusing towards making a positive change in the space, first of all I started making changes in my own habits and daily life, whatever the choices I was making to make it more sustainable and bring my carbon footprint slow. And with that, I mean, let's say going vegan and not flying and all these kind of things. But then it didn't really take me long to make these changes. And I was like, okay, I'm out of the solution. What should I do now, like when I'm done with myself? I thought that, okay, let me go out and share my journey with other people. That, hey, if I can really communicate the message to them and if they would want to also be the part of the solution. That's when I started, let's say, putting out photos which communicates the climate change in a human story and let's say writing about it in social media or else on my own blog or else on other platforms where I contribute. And apparently another idea struck me that, okay, why don't I do one thing that art installations are really something which attracts a lot of attention. And I thought, can I create some quirky art installations which will make people look into it? And once they look at the art installations, my art installations will have their own background stories. So to name the art installations, I have got the opportunity to work up until now. One is in 2017 in Spiti Valley, which is named as I Love Spiti, I Heart Spiti. So the installation is made out of 600 to 700 plastic bottles thrown by people in the Spiti. And we collected them and then made this art installation with the message to people that if you love Spiti, do not throw plastic bottles around. And the second one in 2019 December in Calicut, Kerala, where we created world's first marine symmetry. The idea was again, very simple that how we are throwing plastic bottles here and there in single use plastic, eventually which is going into marine and affecting the marine life in the ocean. And that's why we thought, okay, we can come up with this message in MAKA, marine symmetry out of single use plastic bottles to communicate. To not to use single use plastic bottles and even single use plastic. And after like this in 2019, 2020, this last year, December I created third art installation, which is called world's first single use plastic deathbed. The idea is again, very simple that every year on an average an Indian ends up throwing 260 kgs of plastic. Right? And also this is not only about what you are throwing out there, on an average, a human ends up eating five grams of plastic every week and 250 grams of plastic every year. My God, this is like crazy numbers. So you're talking about microplastics that we consume in our everyday food and everyone is consuming this. Oh my God, that's a very big number. Exactly, because at the end of it all, when we throw these plastic bottles out there or any kind of plastic, it starts breaking down and it turns into microplastic eventually, which is there in the water, which is there in the soil. And eventually it comes back to us and we consume it. So even today and every day, whatever we are eating, that food does consume a microplastic. And that's why we thought that's how I came up with this idea that plastic is eventually coming back to us and killing us. So it's an invisible killer and will make a deathbed out of the plastic to communicate the message that how the plastic you're throwing itself is killing you. So plastic is a deathbed for you. And you've certainly succeeded in making an impact, Akash, because your art installations have won so many awards and brought awareness to the exact problem that you were trying to address. I think it's incredible what you have done and congratulations on all your success. And I think that the work that you're doing is so important just to get more awareness out there, to make a positive change in terms of your own habits and then possibly habits of others around you. Because I think like Rachita often says that the climate change is the next pandemic. We're going to face it if you're not already facing it. So congratulations. And we have to start with ourselves. So it's just wonderful that you've done this for yourself and now you're spreading the word around and it's really, really incredible work, Akash. Thank you so much. And before we take a break, Akash, do you think you can give us some tips on how we can reduce our own carbon footprint personally for our listeners? Okay, how can we reduce our own carbon footprint? Okay, one and the easiest and the biggest is cut down on your, let's say, dairy products, non-vegetarian products. Try as much as you can consume plant-based. If you eat plant-based, I'm sorry, I'm not advocating veganism or anything. I'm talking clearly about carbon and plant-based. If you eat plant-based, you can really cut down your carbon footprints and methane footprints drastically. Like there's no better way to create an impact when it comes to carbon and methane footprints than going plant-based. Like every other thing, like we talk about a lot like about fossil fuel and all these kinds of other contributors to greenhouse gases, but no, the biggest one is methane and carbon coming from the animal agriculture. Right. Yeah, that's wonderful. It's also like, when you change, make fundamental changes at home, like for example, you said, you're eating habits or probably changing your toothbrush. It's a one-time effort and then it really, really saves you from using a lot of plastic in that span of time that you're using a wooden toothbrush or say like a wooden comb. So yeah, these changes, I think, take a little effort, but then it's a very long lasting effect. So definitely, yeah. Yes. And on that note, we're going to take a short break. And on the other side of this break, we're going to discuss Swami Vivekananda's teachings, Simon Sinek and the Harry Potter series. Stay tuned everyone. We'll be right back. Welcome back guys. We still have with us Akash Dhani-san. Hey Akash, that was a very informative first half. And we want to wish you the best of luck on all your future creations and hope that your art installations very well deserving of the awards they've received. And we hope that the future ones receive some spectacular awards as well. That's very, very relatable. And it's very important that the message that you're spreading. So all the best for that. Thank you. Thank you so much. And let's talk about, you know, we started this episode with a few quotes from Swami Vivekananda. And you know, he's one of the greatest thinkers of our century, especially emerging out of India. And the impact he had on the world was quite phenomenal. So Akash, tell us about what impact Swami Vivekananda's teachings have had on your life. So I think the biggest credit of me being able to do anything and me being confident and me being someone who believe in my own self and like whatever good things I have, like a big portion of thank your credit goes to Swami Vivekananda only, because I was this kid in school that I was like, who gets bullied or who doesn't really perform in the exams or sports or anything, right? Who does not have any friend. I was that kid in school. And I wasn't like really able to find that who am I? What do I want to do? And one day like I at my nanny's place, I was living there while I was in ninth class. And my mosi, like masi, my mom's sister, she bought a few books of Swami Vivekananda, which are like very tiny, three centimeter by three centimeter as tiny as that. And I saw them and I felt like these are super cute. And if I can just take these books with me to the school, I believe the other kids in my class will find it attractive. They'll come to me, they'll sit next to me and talk to me and become my friends. I'm like, okay, cool. I sneaked into my mosi's room somehow without her knowing it. I stole those two tiny books and took them to school. Next day, while the ruses was there, I took out the fancy books and I was like reading them, like not really reading, reading pretending that I'm reading so that somebody will see and come to talk to me, but nobody came. I was the one just reading them. So I think they are attractive, but in a different way. It doesn't attract everyone. Like the book knows who's the good reader, might be that kind of a thing, some magical books. So it's like the book chooses the reader, isn't it? Indeed, like the one chooses the person, exactly. So I think that's how it worked out for me. So it's like, that was the first time I got to read Swami Vivekananda and the reason I like just continued reading him or like really felt the vibe and connection with this is because before Swami Vivekananda, everyone was telling me negative things about me, to myself, which is like, hey, you are not doing good. You don't study, you're wasting money, you're wasting time. You are not doing good and all these kinds of things. Right, in Swami Vivekananda was very positive. He was always saying good things to me, that you are a hero. Always say you have no fear. Whatever you want, you can do it. Believe in yourself and all these kinds of positive things. And before this, I never got any, this kind of book, let's say so-called self-help category books, right? Where I get to learn good things about myself and where I get to learn that I need to believe in myself before I can really go out and do anything. So that's why I think I really fall for it. And I wouldn't say fall, I think I started trusting him because he was the one who really got me the opportunity to be this strong and confident person. So that's how the journey started with Swami Vivekananda's reading. So like the best mentor. Indeed, indeed. And I think I always feel like he has answers to all of the things I need. So I can just go back to a number of books and keep reading them and eventually he'll be able to help me with everything. You know, I think one of the first graphic novels or comic books I ever read was one of Swami Vivekananda's story where he travels to the East in a boat and he kind of has to address the Western audience for the first time. Hmm, Chicago I think? In Chicago, I think, yeah. And he addresses the audiences as his first words are, hello brothers and sisters. Of America. Of America. And it's so different from the usual address that the whole audience broke into applause just from those open words. Yes. And you know, just the teachings are so good and so pure. And like you rightly said, they reinforce a belief in yourself and teach you how to depend on yourself through tough times. So fantastic. Any of his books, any of his teachings, in any form I would say are fantastic to pick up just for a little, you know, pick me up when you're feeling down. Yeah. Totally z readable and yeah. And he also doesn't like, he has never written things in a way that, okay, you have to start from A, B, C and then V to Z. Any of the book you can pick and you will be able to start from then and there only. So a lot of time people ask me that, okay, if you like Swami Vivekananda so much, if he has helped you, tell me a name of the book I should go and read. And I believe that while people will be listening to our audio, they will be thinking that, hey, now which one book, which book I should be picking up, tell us, tell me that as well. So I can recommend that whichever city you are into, try to see if you have Ramkrishnamurth over there, you can go to Ramkrishnamurth, they have libraries along with it. And you can buy the books by Swami Vivekananda by other yogis there as well in the mission itself in a very cheap price, let's say 12 rupees, eight rupees, six rupees, two rupees, 20 rupees. So they don't really print these books for making profit. They do it in as cheap price as possible. So it won't be expensive to buy as well. And they are like short books as well. And like if you need bigger books, they have them as well. But I'm more of the short book guy, because then I get bored. Okay, that's a great recommendation. And so the next author that we're moving on to is the incomparable Simon Sinek. I think all three of us are huge fans of Simon Sinek. So if we actually start to talk about it, it will probably go into a four hour episode. Indeed. But Akash, you know, our open library project, the ethos of our open library project is based on Simon Sinek's Golden Circle and the why, how and what of business and why we are doing what we are doing. So tell us a little bit about why Simon Sinek is special for you. So why Simon Sinek is special for me, because I think a few reasons. One is I think he's not really a corporate guy, I believe. He is always seen with corporates. He's always seen with informal clothings and professional events. But I think he's a guy trying to put soul in the professional world. He's the guy trying to put good emotions into the whole professional world because the professional world is somewhere becoming a robotic world, wherein he's trying to come back in the world and trying to communicate that why asking people, this thing is more important that, hey, why couldn't you do this? Like, how can I help you? Rather than going them and telling them, why didn't you do it? This is not done, you have to do it. So asking people that why you couldn't make it so that I can help you rather than standing on their head and like cutting their salary or these kinds of things. So I think that is the reason I really like Simon Sinek because he's not just, he just don't really teach me how can I grow and make more money, but he teaches me how can I be connected to the roots and connecting on the same point, I can share a short story. So Simon Sinek always says, start with why. And obviously he keeps promoting this philosophy. He has written a book about it as well. So while I was cycling from Chennai to Bangalore, I asked the same question to myself, but in a different, let's say topic. And the question was that why my name is whatever it is. So as that point of time in 2015, my name was Akash Mishra. Okay. But currently my name is Akash Ranesan. So how did this happen? This happened because I asked the same question to myself, why my name is what it is. So Akash, I explained myself, Akash is a very good name, let's say confident, blue, no limit and all these kinds of things. I'm like, okay, very good name, keep going. Then I'm like, okay, what is Mishra? I'm like, okay, it belongs to my forefather family. It belongs to a religion, it belongs to a caste. And then I'm like, okay, my father doesn't live with me. He never was there for me and my mom. And even when he was there, he ended up creating problems rather than like solutions or support or love and care. And then I was like, okay, I don't find this a good reason to keep this name. Then I'm like, okay, caste. I'm like, okay, I'm not really someone who is able to, let's say like who believes in caste as of today. Because the way I have seen things out there that people keep making two, like as in political parties or two, some leaders keep making other people fight because of the caste. I somehow started to hate it. I will use the word hate because it's really a strong word, but I would say that, hey, if this is a reason that which can make me fight with other people, okay, I don't wanna be a part of this group then. I would like to be left alone on the ground rather than become a part of the group so that eventually people for their own benefit can make me fight with other people. So that doesn't really play well with me. Also then the religion thing also similarly came to me that I'm like, hey, I don't have limits. I'm like sky and open. Then why then a religion is telling me what to eat, what not to eat, right? And then if I don't wanna eat non-veg, I won't eat because I believe that, okay, I shouldn't be killing animals, right? That's it. And I wanna have my own stronger reasons behind doing something rather than just blindly believing on something, right? Because the, right? And again, religions also is telling me that, okay, which women can I marry or I can't. I mean, you know what, for me, like the way my thought process work, if I really love someone, I know I can live with them rather than believing that, okay, no, this girl has some different kind of a kundali and I have a different kind of a kundali and it won't work together. So these kind of the whole conversation from Chennai to Bangalore I had, and I decided, okay, Mishra isn't working with me at all. Akash is perfect. But then I was like, okay, am I gonna be just Akash or is there some identity I have? Because usually the second names are the identities we have. That's how people know us, right? So I was like, okay, how do people know me? And I just closed my eyes and then went into flashback, seeing that what is my identity? How do people address me? How do people know me? And I realized that the most of the time people, when they have addressed me, they have addressed me in a way by my mom's name, which is Rani, and they have called me Rani ka beta, kaha hai Rani ka beta, khata nahi hai Rani ka beta, aaya nahi hai, or something like this. And I realized Rani ka beta is my identity because usually Sharma ji ka beta is like called unki identity, jingki fathers ka sunne Sharma hota hai. And I was like, nobody was there calling me Mishra ka beta or Mishra ji ka beta. And hence I realized Rani ka beta is my identity. So I was like, but Akash Rani ka beta isn't a name I can keep for myself. So I was like, okay, let's rebrand it. And that's how I came up with Akash Rani Sen. And this is because I just asked myself the question which Simon is asking every one of us to ask, right? And it gave me a little clarity and I feel much confident with this name rather than I would have felt with the other one. That's really wonderful and very, very true. I think you should be remembered and you should carry on the legacies of people who contributed to your life literally. And I also totally agree that Simon Sinek builds a lot of value into the business ecosystem. And he talks about people, he wants to be a people's person. He says that that is the most important factor when you are able to be there for your team. So yeah, I think the value system is super strong as to why you're carrying out this certain kind of business. And this, the takeaway that you have taken from it is absolutely wonderful. So I'm very, very proud to know that you have taken such a step, Akash. It's just one. It's absolutely amazing because you've reclaimed something that our whole lives we struggled against to make this decision. And it's amazing that we are always living up to the names given to us by our parents or our forefathers' legacies or things like that. I think what you have done is taken your legacy into your own hands. And I'm really excited to see what comes in the future from your part. And really congratulations. I think inadvertently, I don't know if you know this, but it's Icelandic custom where, you know, the father's name becomes your last name. For example, Daniel Ericsson. So Ericsson means Eric's son. So Daniel's father's name is Eric. Then Daniel's son, if his name is William, will become Daniel Williamson. So, sorry, William Danielson, sorry. Yeah. William Danielson, yeah. So I think amazing stuff, Akash. And moving on to the next book that we're going to speak about. And it's obviously one of the most popular book franchises ever to exist and a favorite amongst all three of us once again, the Harry Potter series. So Akash, tell us why the Harry Potter series is special for you. So why is Harry Potter special for me? So as I shared in like last few minutes that how I was this bullet key kid and I was not like doing things properly or I was not getting what I wanted. And that's when I like in the childhood when I watched Harry Potter's first part and I was like, okay, this is somewhere relevant to me. But then again, I was not really able to watch all of them. So that's when I got that, okay, if I can. And my school, the one I was studying in that point of time had these series over there. That's when I got the opportunity to read these books. And what really got me going with all of these books and the whole Harry Potter story is how Hagrid comes to call Harry to go to Hogwarts with him to study over there. And that was that one moment. That's the only one hook moment I was looking for that the life before Harry gets to go to Hogwarts and the life after that, that's it. So before life, I already have that, right? As in at that point of time in childhood. And I was just hooking to the book, thinking that, okay, one day I might get the letter as well. Because obviously I was believing that Hogwarts do exist. And I think even today Hogwarts do exist somewhere. Right? I'm not able to say, it might be possible some... We're all waiting for the letter, by the way. Ages development, we're all waiting for the letter. I go out and ask my watchman every day, did my pay later come? But I've already got my dresser sewn by myself. I'm like, okay, I won't waste too much time. I'm ready. Yeah, exactly. I've read everything that was needed. But obviously this thought just kept me hooked to the whole thing that, okay, if one day I get the letter, let's just keep reading, what will happen next? How is this cool? I want to know more about it if I get to go over there. So that's how I think my journey began with Harry Potter. And the world of this whole story was kind of peaceful time I had. Because as in my real life isn't really good enough. In real life, I'm Harry before I go to Hogwarts. And that is why to just skip from my real life, I would just read this book and I would just, let's say, jump into this ocean of amazing magical world where I get to do whatever I want. I can just flick my wand and make whatever I want to make happen. So that's why I think I got into Harry Potter and I still watch it today. Still on my Amazon Prime, if I open my screen and in the front, we'll see at least two Harry Potter series over there, that at least I can watch them now. Because now I think once I was done with watching, with leaving Harry Potter, I thought now I want to jump and now when I can watch all of them, I want to watch it. So yeah. I actually think, Akash, that you know, you probably have got the letter, which is basically, you know, your wand is- Yeah, so we can look. Yeah, yeah, it was your letter to a new life and a new perspective. And I think your wand is making magic and changing, you know, things that are- We are art installations, definitely, Akash, I think. I think. Yeah, that's a good perspective to see. I was just wondering, do you feel like now you're in a, now do you feel you're in a post-Hagrid situation with your life? Yeah, totally, totally. But see, if I tell you, you put it really well. See, for example, my Dumbledore is Swami Vivekananda. Okay. Right? And the letter is obviously the book. The first one I picked from him, that's the letter. And obviously the books are fancy in Harry Potter, as we have seen, and my books were super fancy, right? So fancy, right? And then apparently the place where I live, I live in the mountains, it's amazing. And if I see out, and it's cold, it's winter, it's snowy, it's all white, and I see small tiny lights, the off the whole valley, small tiny huts and places. And so exactly I can feel Harry Potter. Yes, exactly. And I tell you, if you go to my Instagram, you'll find there are posts where I have created scenes of Harry Potter in real life and have posted them along with the clip of the books as well. That in the books, they have shown some photos and I have clicked similar photos in real life. And I have posted both of them there. Lovely. Wow, that's amazing. That's a wonderful bit, I think about Harry Potter. It brings a lot of, you know, hope, and it brings our values like love and friendship. It's just so much more than, you know, just a book to me. And I think to a lot of people. Indeed. Yeah, and Akash, I think you have a very unique view on horcruxes, and we'd love to hear about it, because I've met a lot of fans over the years, but I've never heard this interesting take on it. So tell us a little bit about horcruxes and you know, how you kind of see them, Akash. So how I see them is, in a way like, I think, yeah, so when I start, no, I think that would be a really long story. So see, if you have muscles, if you're really strong, if you want, you can punch someone and break their jaw into, or else, if you can use that same strength to save someone, right? So it's like, how do you see things? How do you use things? What you already have, right? And I think, I don't know how I got this positive thinking because of Swami Vivekananda or what other situations in life this gave me this thought process of seeing things in a positive way, but because of these positive thinking, I could see horcruxes in a positive way. So horcruxes, what are horcruxes? Simple, the villain of the whole series, Harry Potter, breaks his soul into nine different pieces. He wanted to break into seven, but he ended up breaking into one extra and one himself, overall nine. So he, and what are these horcruxes? Let's say a Chiara or a stone, right? Or a snake. So any random things he can choose and put a part of the soul into it and keep it somewhere super away from people where they can't reach and to reach, they might even die on the way and they can't even find it. And these are very ordinary objects to find and to kill the person as into the villain, you have to find all of these horcruxes and kill them. So in a way, these small horcruxes holds a part of the person, a life of the person. So that's how I, when I was now with this knowledge, I was traveling, I was going my own roads and places and I was meeting people who are giving me lift from one place to another. One day somebody was giving me food, another day somebody was giving me some lift or a place to stay and all these kinds of amazing experiences. And at the end of it all, I started from my place with empty pocket, right? And I was just traveling, still I was able to complete these kilometers and kilometers of journey. How I was able to do it? Because of the people, they were making it happen. And in a way, somewhere on the travel, I felt that these people who are helping me, who are taking me ahead in my life are my horcrux. Because if you kill these people, you kill me. If they don't exist, my story won't exist. Yeah. For example, Swami. Yes. Yes, they are part of me. They make me, they complete me. For example, if we remove Swami Vivekananda, I would be just a random guy out there on some random city doing a small, tiny job of 10, 15, 20,000 rupees, right? But the growth, he has given me the knowledge he has given me, right? The wisdom he has given me. So because of Swami Vivekananda, I do not, like if he's not there, I do not exist. So he's one of my horcrux. Similarly, everyone who plays a role. So in a way, like now what? It's okay, I made these people my horcrux. But now the other part of the story that Lord Voldemort does anything to save the horcruxes. Right. Because if any horcrux die or get destroyed, he will die. So that is how I got this connection with people that I want to save my people, the people who invest in me. I want to save them. I want to do whatever I can to save them. And I know in real life, you don't really have to go fight and save them, but respect them, value them, value their time, value their presence in your life, right? And give them the value back, right? And love them, care about them. I think that's what I learned from horcruxes, that how I can really take care of the people and why they are important to me. Because without them, I'm incomplete. That's just a wonderful take, Akash. That's an absolutely positive take on horcruxes. I don't think it's so unique. I don't think anyone, I think that's unique to you, Akash. That kind of, I guess, sums up what you're trying to do with your work also. And you are really saving people, many more than who contributed to your life. So it's wonderful. Thank you so much. Thank you so much. So Akash, before we let you go, where can people reach out to you on social media or see your work on social media? So I think rather than telling the platform, I can just tell you my name and you can type it anywhere. Like I am on Instagram actively, but I am on Twitter and LinkedIn, as well as people who wanna connect me over there if they wanna visit my blog. My name is Akash Ranesan, W-A-K-S-H Akash, R-A-N-I-S-O-N. And because of this unique name, I have the same username everywhere. So Instagram, slash Akash Ranesan, Facebook, slash Akash Ranesan, Twitter, slash Akash Ranesan, or akashranesan.com. So super easy. Perfect. Thank you so much for being on our show, Akash. And I hope our listeners had as much of a good time listening to you as we did. I think we learned a lot along the way, especially regarding climate change and the amount of plastic we are all consuming, which is an insanely large amount. So I think we all need to start adjusting our lives and try and positively impact people around us as well if we want to escape this definitely oncoming pandemic. Right. Indeed. And thank you so much for inviting me and giving me the opportunity to share my story with you and all of your amazing listeners. It's really been a pleasure. Thank you so much. Hi, my name is Abbas. On Has It Aged Well, Me and Urjita are joined by Nivedita Prakasham and we're discussing 2004's Hum Tum. What does this movie say about gender roles? Has it aged really well or has it sunk like the Titanic? We'll discuss all this and more on the IBM Pop YouTube channel and podcast feed. Check it out. Hi, I'm Anubham Gupta. And on this episode of Paisa Paisa, I speak with Bhuvana Sriram and Harish Menon of House of Alpha. We covered the entire gamut of investment advisory, financial planning, basic rules, tips for a better financial plan, equity outlook and whole lot much more on this episode of Paisa Paisa."}, "podcast_summary": "In this episode of the podcast, Paperback by the Open Library Project, the hosts Satyajit and Rachetha interview climate activist Aakash Ranisan. Aakash discusses his journey into climate activism and his award-winning art installations that aim to raise awareness about climate change. He shares how he uses art to communicate the message and highlights the importance of individual actions in reducing carbon footprints. The hosts also discuss the teachings of Swami Vivekananda and the impact it has had on Aakash's life. They touch upon Simon Sinek's philosophy of starting with why and its relevance in the business world. Finally, they talk about the Harry Potter series and its significance for Aakash, who found solace and inspiration in the magical world of Hogwarts. Aakash also shares his unique perspective on horcruxes and the importance of valuing the people who contribute to our lives.", "podcast_guest": "Aakash Ranisan", "podcast_highlights": "Podcast Highlights Summary\n\nTitle: Paperback by the Open Library Project\n\nHosts: Satyajit and Rachetha Sharma\n\nGuest: Aakash Ranesan\n\nDuration: N/A\n\nEpisode Number: N/A\n\nRelease Date: N/A\n\nIntroduction:\nAakash Ranesan, a climate activist, content creator, and TEDx speaker, joins Satyajit and Rachetha on the show. They discuss climate change activism, Aakash's art installations, and later delve into topics like Swami Vivekananda's teachings, the Harry Potter series, and Simon Sinek's book \"Start With Why.\"\n\nKey Moments:\n- Aakash discusses how he got into climate activism after falling in love with nature while traveling. He started making sustainable choices in his daily life and then decided to share his journey with others through social media and art installations. He describes some of his notable art installations, including one made from plastic bottles collected from Spiti Valley and another highlighting the impact of single-use plastic on marine life.\n- Aakash shares the impact Swami Vivekananda's teachings have had on his life, particularly in building confidence and self-belief. He credits Swami Vivekananda for helping him become a stronger and more confident person.\n- The conversation shifts to Simon Sinek and his concept of starting with why. Aakash praises Sinek for infusing soul and positive emotions into the professional world. He also shares a personal story of how he applied Sinek's philosophy to rebranding himself by changing his surname to reflect his identity better.\n- The discussion then moves to the Harry Potter series and its significance for Aakash. He relates to the protagonist's journey from a troubled life to a magical world filled with possibilities. Aakash discusses how the series provided an escape and a sense of hope during challenging times.\n\nMain Takeaways:\n- Climate change activism requires making sustainable choices in daily life and sharing one's journey with others.\n- Swami Vivekananda's teachings promote self-belief, confidence, and a positive mindset.\n- Simon Sinek encourages bringing soul and positive emotions into the professional world by starting with why.\n- The Harry Potter series offers hope and escapism, inspiring readers to believe in limitless possibilities.\n\nQuotes:\n- \"Anything which makes you weak intellectually, physically, and mentally, reject it as poison.\" - Swami Vivekananda\n\nRecommendations/References:\n- Swami Vivekananda's books\n- Simon Sinek's book \"Start With Why\"\n- Harry Potter series by J.K. Rowling\n\nClosing Thoughts:\nAakash's positive and impactful journey as a climate activist and content creator highlights the importance of making sustainable choices and communicating the message to inspire others. His admiration for Swami Vivekananda, Simon Sinek, and the Harry Potter series reflects the power of self-belief, positive thinking, and limitless possibilities. Listeners are encouraged to explore the recommended books and resources to delve deeper into these topics."}